/*
 * ***********************************************************************************************
 * Create date: 2023/4/28
 * Author: ming
 * Last modify date: 2023/4/28
 * Description: redis connection head file
 * ***********************************************************************************************
 */

#include "main.h"
#include <hiredis/hiredis.h>


/*
 * ************************************************
 * 描述：该函数连接Redis服务器
 * 参数：host是redis服务器的地址，port是redis服务器端口
 * 返回值：如果连接成功返回0，连接失败返回1
 * ************************************************
 */
int connectToRedis(char *host,int port);
